//А if – це як чарівне слово:
// "Якщо … тоді зроби …"
// 🔹 if ... else-(інакше)
// ✅ Отже:
//     if → перевірка умови ("якщо…").
//     else → що робити, якщо умова неправдива.
//     else if → перевіряє інші варіанти.
// 🔹 Що таке if у програмуванні
// if — це оператор перевірки.
//     Він відповідає на питання:
//     👉 "Чи виконується умова?"
// Якщо так (умова = правда / true) → виконається певний код.
//     Якщо ні (умова = неправда / false) → цей код пропускається, або спрацює інший (else).
// 🔹 Де використовується
// Майже всюди у програмуванні, коли треба вибір.
//     Наприклад:
// Керування грою (якщо герой торкнувся монетки — додати бали).
// Вебсайт (якщо користувач залогінений — показати меню, інакше — показати кнопку "Увійти").
// Щоденні задачі (якщо температура > 0 — показати “тепло”, інакше — “мороз”).
//Комбіновані умови (логічні оператори && – "і", || – "або")
//🔹 Отже, умови для використання if:
// Коли є ситуація з вибором (так / ні, або кілька варіантів).
// Коли треба контролювати поведінку програми.
// Коли рішення залежить від даних користувача, стану програми або результату обчислень.

// let color ='red';
// if (color === 'red') {
//     console.log('stop');
// }else{
//     console.log('go!')
// }
//перевірка віку через promt ()

// let age = +prompt('enter you age')//+ перетворює значення із стрінги в число
// // console.log(age, typeof age);// перевірка що це
// if(age >=18 ){
//     console.log('adult');
// }else {
//     console.log('cartoon');
// }

// let color= prompt('enter color');
// if(color === 'red'){
//     // тут можемо ще використовувати інший if і наприклад перевірити машини
//
//     if(confirm('is road clear')){// чи дорога пуста //confirm()-це тесаме що промт але тільки повідомлення пише
//         console.log('go');
//     }else{
//         console.log('just wait');
//     }
//
// }else if(color === 'yellow'){  // else if - перевірка множина коли потрібно перевірити більше чим 2 рази
//     console.log('wait');
// }else if(color === 'red'){
//     console.log('stop');
// }else{
//     console.log('the end')
// }
// //може бути останім else може і небути залежить від умови.


//за допомогою операторів &&/or/and можна не писати
let color= prompt('enter color');
let isRoadClear = confirm('is road clear');
if(color === 'green' && isRoadClear){//але тут є свої +/-,якщо так "ok" то виконається умова якщо ні то
    //тоді ми не можемо обробити варіант і else ifможна створити окрему зміну(b)->(isRoadClear)
    console.log('go');
}else if(color === 'yellow'){
    console.log('wait');
 }else if(color === 'red'){
     console.log('stop');
}else{

     console.log('the end')
 }
//else if можуть існувати множині перевірки і вередині також
// }else{ не можуть бути множині перевірки тільки всередині.
