
// function asd() {
//     let x=10;// несе в собі обєкт
//     function inner() {
//         return ++x;// повертає змінений об'єкт
//     };//  ця функція зараз тут не працює вона описана це називається локальна функція
//     return inner;// тут ми повертаємо інер опис
// };
//
// console.log(asd () );//ƒ inner() {
//                    //   return ++x;// повертає змінений об'єкт
//                    // }
// // то ми тут отримаємо опис inner тобто витягнули йог інер і цей інер силається на зміну х,
// // А зміна видна тільки локально в цій функції.Коли ми використали return ф-ї asd та ніяких
// // помилок е відбувається тому, що ця функція внутрішня зав'язана на цій зміні і тут ми витягуємо просто посилання
// // на неї так це і є замикання.Тобто ф-ю перенесли- викликали н зовні витягли її як внутрощі, але вона досі
// // зв'язана з певною зміною яка знаходиться в цій області видимості.То якщо це ф-я то її можна викликати і виконати її
//  // отримаємо проінкрементоване значення
//
// console.log(asd () () )// 11
// // або можна так запакувати її..вилик цього return inner; в окрему зміну,яка буде служити 3 ім'я для нашого інера,
// // викликати то воно буде збільшува і зберігаючи стан
// let foo=asd ();
// console.log(foo());
// console.log(foo());
// console.log(foo());


let user={name:'oleg', age:123};
// наразі всі властивості відкриті в цій фунці і може кожен змінити їх як
user.age=-10500;
console.log(user.age);
//ми зробимо функцію замикання, щоб ніхто не міг змінювати дані

function userBuilder (name, age){
    let user = {name, age};// ми хочемо маніполювати даними, то б то подивитися, а не змінювати
    //можемо сказати що повертаємо об'єкт в ньому буде лежати функції
    return {
        getName(){
            return user.name;
        },
        getAge(){
            return user.age;
        },
        setAge(age){
            if(age > 0){
                user.age = age;
            }
        }
    }
}
// а це означає що якщо я викличу функцію і передам значення і попрошу дати мені подивитися що в середині тебе існує
// то покаже існування функцій в ньому.

let builder = userBuilder('Masha', 45);
console.log(builder);//{getName: f,getAge: f}
//кожна з функцій звязана локально на  об'єкті user а це означає що до user не можемо доступитися
// напряму буде помилка console.log(user); а якщо так
console.log(builder.getName());// тільки дивимося на ім'я
console.log(builder.getAge());
// ЗМІНИТИ НІ ЯК НЕ МОЖНА
// а щоб можна було зміни ти то робимо ще одну функцію
builder.setAge(100);
console.log(builder.getAge());
// не дость поставити випатково мінус, це є явний захист від помилок
// ЗА ДОПОМОГОЮ ЗАМИКАННЯ ШТУЧНО РОБИТЬСЯ замиканя яке називається інкапсуляція 
