//функція викликає сама себе-якщо запустити цю функцію то браузер зависне
 function foo() {
    console.log(foo);
    //foo()
 }
 foo();
// чому так стається спочатку викликаемо 6 вона іде в 3  потім викликає себе 4 ізнову іде 2,а
// потім вона наново викликає до нескінченності тооб то не має процесу закриття,і це буде штопор виконується 11,5
// тисяч разів і потім буде помилка
// Сама пособі РЕКУрсі потужний інструмент і не безпечний
// РЕКУРСІЄЮ можна замінити цикл- можемо про ітерувати масив без циклу рекурсією/
// В Рекурсії повина бути завждди умова (if), щоб не було рекурсіоного випадку тобто помилки

// function iterator(arr,i){
//     console.log(arr[i]);
//     i++
//     if (i<arr.length){
//         iterator(arr,i)
//     }
// }
//
// iterator([11,22,33],0);
//розкладати багатовимірні масиви розкладати на одновимірні масиви  є така функція (флетмем)а ми можемо зробити її
// Рекурсія може використовується в тому випадку коли потрібно робити якісь операції  тобто подорожі робити по
// об'єктах або масивах вкладеність яких або рівні або просто не знаємо
//Робимо функцію в якій не знаємо яка

let arr=[11,22,33,[44,55],[78,90,[55,908,67]],56,89,[22,66]]// 11,22,33,44,55;

let innerArray = [];// створюємо внутрішній масив

function flatter(array) {
    for ( const item of array ) {// робимо ітерацію по зовнішньому масиву
        if(Array.isArray(item)) {// якщо item являється масивом
            flatter( item);// тобто зробити рекрусивний виклик зробити
        }else { // якщо item не являється масивом, то додаємо в innerArray
            innerArray.push(item);
        }
    }
};
flatter(arr);
console.log(innerArray);
