//Promis дає можливість позбавитися колбеку хел
// як потрібно зробити ланцюг асинхроних операцій

// setTimeout(()=>{
//     let x =1;
//     console.log(x)
//     setTimeout(()=>{
//         x++
//         console.log(x);
//         setTimeout(()=>{
//             x++;
//             console.log(x);
//             setTimeout(()=>{
//                 x++;
//                 console.log(x);
//                 },1000
//             )
//         },1000)
//     },1000);
// },1000)// все це дає колбек help (в середині це є область видимості)
// коли у нас буде дуже багато асинхроних послідовних операцій яка буде знаходитися одна в одній
//то отримаємо візуальну проблему=> callback hell- працювати не зручно так

// дає можливість працювати з такими речами більш вишуканим способом,це просто обгортка
// яка дозволить ліпше і легше спокійно працбювати з подібними речами

new Promise((resolve) => {
    setTimeout(()=>{
        let x =1;
        console.log(x);
        resolve(x);
    },1000)
})
    .then((x)=>{
      return  new Promise((resolve) => {
          setTimeout(() => {
              x++;
              console.log(x);
              resolve(x);
          }, 1000)
      })
    })
    .then((x)=>{
       return new Promise((resolve) => {
          setTimeout(()=>{
              // console.log(x);
              x++;
              console.log(x)
              resolve(x);
          },1000)
      })
  })
    .then((x)=>{
       return  new Promise((resolve) => {
            setTimeout(()=>{
                x++;
                console.log(x);
                resolve(x);
            },1000)
        })
    })


//хочу в ланцюговому порядку працювати асинхрон (resolve- сприймаю як об'єкт який спроможний
// перекинути інформацію зодної асинхроної функції до другої тобто на наступний виклик resolve(x))
// проміс не вирішує самий процес обробки асинхронних викликів,він вирішує візуальну проблему і дозволяє
// нам працювати з асинхроними діями в більш зрусному варіанті
