//rest Arguments-це можливість мати функцію з не визначеною кількостью аргументів
// (...x)-означають через виклик передати багато аргументів Х-будесприйнятий як масив


//функція може бути підперегрузкою-

function calc(a,b) {
    return a + b;
};
console.log(calc);
function calc(a,b,c) {
    return a + b+c;
};
//в джаваскрипні не можна однаково назвати функції і прицьому давати різні дії тому що буде виконуватися
//крайня функція а перша буде ігноруватися

console.log(calc(a,b));//nan
//як вирішується така проблема коли ми хочемо мати ф-ю з однаковими назвами але з іншими даними
// (аргументаими) за допомогою спеціальною зміною.

function foobar(){
     console.log(arguments);
     if (arguments.length===2){
       return   arguments[0]+arguments[1];
     }else  if (arguments.length===3){
         return   arguments[0]+arguments[1]+arguments[2];
     }//після ми не обмежимо аргументами і не декларуємо їх
};
foobar(1,2,3,4,5);//буде псевдомасив-будуть всі аргументи які передали
// які інструменти нам дає = можна провірити довжину і потім виконвти дії з аргументами
console.log(foobar(40,50,20));
// цей механізм працює тільки тут більше ні де
