//по факту це можливість однієї функції приймати як аргумент іншу функцію,ну бо ф-я являється об'єктом в js
//
// function foo(bar) {
//     console.log(bar);
// }
// foo(100);
// function foo(bar) {
//     console.log(bar);
// }
// foo(100);
// foo(function (){
//     return 100;
// } ())
// //тобто підчас виклику ф-ї foo ми оголошуємо function (){return 100; } - декларуємо і виконуємо цю функцію () вона після себе залишає 100
// // якщо не виконуємо ф-ю  не пишемо ці душки(),без цих дужок показує опис цієї ф-ї і ми можемо її попросити відпрацювати
// // в середині console.log(bar());тут ми змістили акцент виконання ф-її коли ми так змістили то це називається callback
// function foo(callback) {
//     console.log(callback());
// }
// у відповідь тут іде по факту трігаємо функцю фу але кажемо що у відповідь потрібно насправді виконати функцію виконати
// яку передали як аргумент
//  function calc(a,b, action){// action-свідчить про те що потрібно зробити дії з (a,b)
//     // якщо не використовуємо колбеки то тут потрібно писати багато іфів..
//      if(action ==='+'){
//          return a+b
//      } else if(action==='-'){
//          return a-b;
//      }//....тут потрібно описати всі варіації роботи з цифрами.
//  }
 function calc(a,b, callbeck){
      return  callbeck(a, b);
 } // 30

console.log(calc(10, 20, (a, b) => {return a + b}));
// замість callbeck приходить ф-я стрілочна (a,b)=>{a+b}, як в цю стрілочну ф-ю передати і звязати а  і б===  callbeck(a, b);
// Тобто при описі calc ми показуємои callbeck як буде співпрвцювати з аргументами які він приймає .
// А підчас виклику ф-ї  calc(10,20, (a,b)=>{ return a+b}) ми описуємо наш колбек уже з цим урахування
console.log(calc(10, 20, (a, b) => {return a - b}));
console.log(calc(10, 20, (a, b) => {return a * b}));
