////rest Arguments-це можливість мати функцію з не визначеною кількостью аргументів
// // (...x)-означають через виклик передати багато аргументів Х-будесприйнятий як масив
//на відміну Arguments він є справжнім маисвом

function asd (z,y,...x){
 console.log(x)
    console.log(Array.isArray(x))// чи поверне нам тру тобто чи це масив
};

asd(2,3,5,7,8,true)//[5,7,8,true]
// але є нюанс якщо ми використовуємо рест аргумент то він не може ідти не останім,
// якщо ставим не останнім аргументом (у), щоб знати де починаєть (х) а де (у),
// то потрыбно (у) ставити першим, а потім (х)
