//reject= це також спосіб перекидання інформації з одного проміса на інший,
//resolve- використовуємо коли все добре, reject- тоді коли сталася якась помилка


new Promise((resolve,reject) => {
    setTimeout(()=>{
        let x=1;
        console.log(x);
        resolve(x);
    },1000);
})
    .then((value)=>{
    return  new Promise((resolve,reject) => {
        setTimeout(()=>{
            value++;
            console.log(value);
            //resolve(value);
            //якщо буде помилка то вона буде ігноруватися
            //  throw new Error('fdfvgfdbvcv')// помилка є але наступна дія виконується,якщо помилка виникла перед resolve(value)
            // то можна створити своєрідний іф
            if( true){
               reject('error');// в душках причина помилки відаємо причину помилки
            }else{
                resolve(value);
            }
// помилка стається в асинхроній операції до слідуючої асинхроної операції,і код даже
// нище не доходить і на що його потрібно замінити catch()-він відхопить проблему
        },1000);
    })
}).catch(err=>{
    console.log(err);
}).then((value)=>{
        console.log(value);

})



//Підсумок.Проміси в якості колбеку приймають функції яка приймає два аргумента (resolve,reject).
// resolve= виступає в якості return або можливості такого собі моста передачі інформації з одного проміса на вхід іншого проміса
// reject= виступає способом передачі інформації з одного проміса у випадку якщо сталася помилка на блок catch(err=>{})
// який повиний її відхоплювати

