//switch в програмуванні – це теж розгалуження, але воно зручніше, коли є багато варіантів вибору.
//🔹 Пояснення
// switch (напій) – ми перевіряємо, яке значення має змінна напій.
// case "чай": – якщо значення "чай" → виконається цей блок.
// break; – вихід із switch, щоб не перевіряти інші варіанти.
// default: – спрацює, якщо жоден із case не підійшов (як "інакше" в if).
//🔹 Коли краще switch, а коли if
// Якщо треба перевірити багато варіантів одного значення → зручніше switch.
// Якщо треба перевіряти різні умови (>, <, ==, логіку) → краще if
//🔹 if vs switch у JavaScript
// Що перевіряємо	Використовуємо if	Використовуємо switch
// Прості умови (так/ні)	✅	           ❌
// **Різні оператори (>, <, ==, &&,		…)**
// Багато варіантів одного значення	Можна, але виходить довго й незручно	✅ Дуже зручно
// Перевірка діапазонів (наприклад: вік < 18)	✅	❌
// Кілька різних дій для однієї змінної	Можна	✅ Краще
// Можливість "інакше"	else	default

let color = prompt('enter color');

switch (color ) {
    case 'green':
        console.log('go!');
        break;
    case 'yellow':
        console.log('wait');
        break;
    case 'red':
        console.log('stop');
        break;
}
// множина перевірка->switch
//перевірити швидко так/ні то -> if(true/false)
//  case- можуть в середині знаходитися if switch
